import React from 'react'
import styles  from '../../Pages/ProductPage/ProductPage.module.scss'
export default function Rate({rate}) {

    return(
        <div className={styles.rate}>
            <div className={styles.r1}>امتیاز کاربران</div>
            <div className={styles.r1}>{rate}</div>
            <svg xmlns="http://www.w3.org/2000/svg" width="121" height="20" viewBox="0 0 121 20" fill="none">
            <path d="M9.55263 0.330566L12.7997 6.16013L19.1053 7.58792L14.8066 12.6186L15.4565 19.3306L9.55263 16.6101L3.64878 19.3306L4.29868 12.6186L0 7.58792L6.30551 6.16013L9.55263 0.330566Z" fill="#FFCB45"/>
            <path d="M35.0264 0.330566L38.2735 6.16013L44.579 7.58792L40.2803 12.6186L40.9302 19.3306L35.0264 16.6101L29.1225 19.3306L29.7724 12.6186L25.4738 7.58792L31.7793 6.16013L35.0264 0.330566Z" fill="#FFCB45"/>
            <path d="M60.5 0.330566L63.7471 6.16013L70.0526 7.58792L65.754 12.6186L66.4039 19.3306L60.5 16.6101L54.5962 19.3306L55.2461 12.6186L50.9474 7.58792L57.2529 6.16013L60.5 0.330566Z" fill="#FFCB45"/>
            <path d="M85.9737 0.150513L89.2208 5.98007L95.5263 7.40787L91.2276 12.4385L91.8775 19.1505L85.9737 16.4301L80.0698 19.1505L80.7197 12.4385L76.421 7.40787L82.7265 5.98007L85.9737 0.150513Z" fill="#F2F2F2"/>
            <path d="M111.447 0.150513L114.695 5.98007L121 7.40787L116.701 12.4385L117.351 19.1505L111.447 16.4301L105.544 19.1505L106.193 12.4385L101.895 7.40787L108.2 5.98007L111.447 0.150513Z" fill="#F2F2F2"/>
            </svg>
            <div className={styles.r2}>نظرات خود را با بقیه اشتراک بگذارید</div>
            

                </div>
                   
        
               

    )
}