import React from 'react'
import { useState,useEffect } from 'react';
import styles from './ProductPage.module.scss'
import Productcard from '../../Components/Productcard/Productcard'
import Producttab from '../../Components/Producttab/Producttab'
import ProfileHeader from '../../Components/ProfileHeader/ProfileHeader'
import CartHeader from '../../Components/CartHeader/CartHeader'
import SearchHeader from '../../Components/SearchHeader/SearchHeader'
import logo from '../../assets/logo.png'
import bars from '../../assets/bars.svg'
import CategoryItem from '../../Components/CategoryItem/CategoryItem'
import azhini from "../../assets/azhini.jfif"
import CategoryHeader from '../../Components/CategoryHeader/CategoryHeader'

export default function ProductPage(){
    const [windowWidth, setWindowWidth] = useState(window.innerWidth);
    const Categorys = ["کالاف دیوتی موبایل" ,"گنشین ایمپکت" , "کلش آف کلنز", "محصولات فیزیکی", "ایپکس لجندز"]
    useEffect(() => {
        const handleResize = () => setWindowWidth(window.innerWidth);
        window.addEventListener('resize', handleResize);
    
        // Cleanup
        return () => {
            window.removeEventListener('resize', handleResize);
        };
    }, []);
    
    return(
        <div className={styles.fullPage}>
            {windowWidth > 430 && (
                <div className={styles.Header}>
                <ProfileHeader name={"محمدعلی آژینی"} image={azhini}/>
                <CartHeader/>
                <SearchHeader/>
                <img className={styles.logo} src={logo}/>
            </div>
                        )}
            {windowWidth > 430 && (
            <div className={styles.Category}>
                <CategoryHeader icon={bars} title={"دسته‌بندی محصولات"}/>
                <div className={styles.CategoryItems}>
                {Categorys.map((item,index) => {
                    return (
                    <CategoryItem key={index} title={item}/>
                    )
                })}
                </div>
            </div>
            )}

        <div className={styles.w}>
        <div className={styles.wholepc}>
            <div className={styles.pccap}>
                <text className={styles.pccap1}>
                خرید کریستال گنشین ایمپکت
                </text>
                <text  className={styles.pccap2}>
                اپکس شاپ > بازی های آنلاین > گنشین ایمپکت
                </text>
                <Producttab safety={'امنیت'}  obs={'دقت'} speed={'سرعت'}/>
            <div className={styles.appinfo}>
                    <div className={styles.appinfo1}>
                    <text className={styles.appinfo2}>
                        درباره بازی
                        </text>
                    <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
                    <path d="M12 2C10.0222 2 8.08879 2.58649 6.4443 3.6853C4.79981 4.78412 3.51809 6.3459 2.76121 8.17317C2.00433 10.0004 1.8063 12.0111 2.19215 13.9509C2.578 15.8907 3.53041 17.6725 4.92894 19.0711C6.32746 20.4696 8.10929 21.422 10.0491 21.8079C11.9889 22.1937 13.9996 21.9957 15.8268 21.2388C17.6541 20.4819 19.2159 19.2002 20.3147 17.5557C21.4135 15.9112 22 13.9778 22 12C21.9971 9.34874 20.9425 6.80691 19.0678 4.93219C17.1931 3.05746 14.6513 2.00295 12 2ZM12 20C10.4178 20 8.87104 19.5308 7.55544 18.6518C6.23985 17.7727 5.21447 16.5233 4.60897 15.0615C4.00347 13.5997 3.84504 11.9911 4.15372 10.4393C4.4624 8.88743 5.22433 7.46197 6.34315 6.34315C7.46197 5.22433 8.88743 4.4624 10.4393 4.15372C11.9911 3.84504 13.5997 4.00346 15.0615 4.60896C16.5233 5.21447 17.7727 6.23984 18.6518 7.55544C19.5308 8.87103 20 10.4177 20 12C19.9976 14.121 19.1539 16.1544 17.6542 17.6542C16.1544 19.1539 14.121 19.9976 12 20ZM12 11.5C11.7348 11.5 11.4804 11.6054 11.2929 11.7929C11.1054 11.9804 11 12.2348 11 12.5V15.5C11 15.7652 11.1054 16.0196 11.2929 16.2071C11.4804 16.3946 11.7348 16.5 12 16.5C12.2652 16.5 12.5196 16.3946 12.7071 16.2071C12.8946 16.0196 13 15.7652 13 15.5V12.5C13 12.2348 12.8946 11.9804 12.7071 11.7929C12.5196 11.6054 12.2652 11.5 12 11.5ZM12 7.5C11.7528 7.5 11.5111 7.57331 11.3055 7.71066C11.1 7.84801 10.9398 8.04324 10.8452 8.27165C10.7505 8.50005 10.7258 8.75139 10.774 8.99386C10.8223 9.23634 10.9413 9.45907 11.1161 9.63388C11.2909 9.8087 11.5137 9.92775 11.7561 9.97598C11.9986 10.0242 12.25 9.99946 12.4784 9.90485C12.7068 9.81024 12.902 9.65002 13.0393 9.44446C13.1767 9.2389 13.25 8.99723 13.25 8.75C13.25 8.41848 13.1183 8.10054 12.8839 7.86612C12.6495 7.6317 12.3315 7.5 12 7.5Z" fill="#E52A49"/>
                    </svg>
                    
                    </div>
                    <text className={styles.appinfo3} >
                    لورم ایپسوم متن ساختگی با تولید سادگی
                     نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک
                      است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی
                      تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای 
                     زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا
                      با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و 
                     فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام 
                     و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز
                      شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده
                      قرار گیرد.لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک 
                     است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد
                      نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال
                      و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای 
                     علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام
                      و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی 
                     دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.

                    </text>
                </div>
            </div>

            <div className={styles.pcpic}>
            </div>
        {/* <img  className='ipmr' src='https://s6.uupload.ir/files/peakpx_(2)_h6kx.jpg'/>
        <div className='whole'>
                <Box sx={{ width: '100%', bgcolor: 'background.paper' }}>
                <Tabs value={value} onChange={handleChange} centered>
                    <Tab label="سرعت" />
                    <Tab label="دقت" />
                    <Tab label="امنیت" />
                </Tabs>
                </Box>
                <div style={{ display: 'flex', alignItems: 'flex-end', justifyContent: 'flex-start', direction: 'rtl',marginRight:'1%'}}>
                        <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none" marginTop="5%">
                <path d="M12 2C10.0222 2 8.08879 2.58649 6.4443 3.6853C4.79981 4.78412 3.51809 6.3459 2.76121 8.17317C2.00433 10.0004 1.8063 12.0111 2.19215 13.9509C2.578 15.8907 3.53041 17.6725 4.92894 19.0711C6.32746 20.4696 8.10929 21.422 10.0491 21.8079C11.9889 22.1937 13.9996 21.9957 15.8268 21.2388C17.6541 20.4819 19.2159 19.2002 20.3147 17.5557C21.4135 15.9112 22 13.9778 22 12C21.9971 9.34874 20.9425 6.80691 19.0678 4.93219C17.1931 3.05746 14.6513 2.00295 12 2ZM12 20C10.4178 20 8.87104 19.5308 7.55544 18.6518C6.23985 17.7727 5.21447 16.5233 4.60897 15.0615C4.00347 13.5997 3.84504 11.9911 4.15372 10.4393C4.4624 8.88743 5.22433 7.46197 6.34315 6.34315C7.46197 5.22433 8.88743 4.4624 10.4393 4.15372C11.9911 3.84504 13.5997 4.00346 15.0615 4.60896C16.5233 5.21447 17.7727 6.23984 18.6518 7.55544C19.5308 8.87103 20 10.4177 20 12C19.9976 14.121 19.1539 16.1544 17.6542 17.6542C16.1544 19.1539 14.121 19.9976 12 20ZM12 11.5C11.7348 11.5 11.4804 11.6054 11.2929 11.7929C11.1054 11.9804 11 12.2348 11 12.5V15.5C11 15.7652 11.1054 16.0196 11.2929 16.2071C11.4804 16.3946 11.7348 16.5 12 16.5C12.2652 16.5 12.5196 16.3946 12.7071 16.2071C12.8946 16.0196 13 15.7652 13 15.5V12.5C13 12.2348 12.8946 11.9804 12.7071 11.7929C12.5196 11.6054 12.2652 11.5 12 11.5ZM12 7.5C11.7528 7.5 11.5111 7.57331 11.3055 7.71066C11.1 7.84801 10.9398 8.04324 10.8452 8.27165C10.7505 8.50005 10.7258 8.75139 10.774 8.99386C10.8223 9.23634 10.9413 9.45907 11.1161 9.63388C11.2909 9.8087 11.5137 9.92775 11.7561 9.97598C11.9986 10.0242 12.25 9.99946 12.4784 9.90485C12.7068 9.81024 12.902 9.65002 13.0393 9.44446C13.1767 9.2389 13.25 8.99723 13.25 8.75C13.25 8.41848 13.1183 8.10054 12.8839 7.86612C12.6495 7.6317 12.3315 7.5 12 7.5Z" fill="#E52A49"/>
                    </svg>
                        <Typography variant="h1" component="h2" sx={{fontSize:'20px',fontFamily:'Inter', marginTop:'5%', marginRight:'1%'}}>
                        درباره‌ی بازی
                        </Typography>
                </div>
                <div style={{ display: 'flex', alignItems: 'flex-end', justifyContent: 'flex-start', direction: 'rtl'}}>
                        <Typography variant="h1" component="h2" sx={{fontSize:'20px',fontFamily:'Inter',width:'100%', marginRight:'3%', marginTop:'1%', marginLeft:'3%'}}>
                این بازی دارای یک نقشه جهان باز است که بازیکن با پیاده‌روی
                 کوهنوردی، شنا، پرواز کردن و سر خوردن در صورت لزوم به کاوش در آن می‌پردازد
                 بسیاری از اشیا و مکانهای مهم در کل نقشه پخش شده‌اند
                  بازیکنان می‌توانند هر بار حداکثر چهار شخصیت خود را کنترل کنند. با تکمیل تلاش‌ها برای پیشبرد داستان 
                  .بازیکن قادر است در مجموع ۵۳ شخصیت قابل پخش را باز کند. حالت چند نفره بازی با سبک مشابه در دسترس است
                  داستان بازی از آنجا شروع می‌شود که کارکترهای اصلی بازی که یک پسر و یک دختر هستند ناگهان در دنیایی جدید ظاهر می‌شوند 
                  و یک شخصیت منفی تلاش می‌کند که آن‌ها را نابود کند. پس از حمله شخصیت منفی، 
                  بازی از شما می‌پرسد که می‌خواهید از کدام کارکتر دفاع کنید؟ با دفاع شما از کارکتر، 
                  همان کارکتر تبدیل می‌شود به کارکتر اصلی شما و متوجه می‌شوید که پسر و دختر، در حقیقت خواهر و برادر هستند
                   .شخصیت منفی بازی کارکتر دیگر را زندانی می‌کند و حال باید تلاش کنید که برادر/خواهر خود را نجات دهید

                        </Typography>
                </div> */}
                </div>
                <div className={styles.store}>
                <svg xmlns="http://www.w3.org/2000/svg" width="24" height="24" viewBox="0 0 24 24" fill="none">
                    <path d="M10 13H3C2.73478 13 2.48043 13.1054 2.29289 13.2929C2.10536 13.4804 2 13.7348 2 14V21C2 21.2652 2.10536 21.5196 2.29289 21.7071C2.48043 21.8946 2.73478 22 3 22H10C10.2652 22 10.5196 21.8946 10.7071 21.7071C10.8946 21.5196 11 21.2652 11 21V14C11 13.7348 10.8946 13.4804 10.7071 13.2929C10.5196 13.1054 10.2652 13 10 13ZM9 20H4V15H9V20ZM21 2H14C13.7348 2 13.4804 2.10536 13.2929 2.29289C13.1054 2.48043 13 2.73478 13 3V10C13 10.2652 13.1054 10.5196 13.2929 10.7071C13.4804 10.8946 13.7348 11 14 11H21C21.2652 11 21.5196 10.8946 21.7071 10.7071C21.8946 10.5196 22 10.2652 22 10V3C22 2.73478 21.8946 2.48043 21.7071 2.29289C21.5196 2.10536 21.2652 2 21 2ZM20 9H15V4H20V9ZM21 13H14C13.7348 13 13.4804 13.1054 13.2929 13.2929C13.1054 13.4804 13 13.7348 13 14V21C13 21.2652 13.1054 21.5196 13.2929 21.7071C13.4804 21.8946 13.7348 22 14 22H21C21.2652 22 21.5196 21.8946 21.7071 21.7071C21.8946 21.5196 22 21.2652 22 21V14C22 13.7348 21.8946 13.4804 21.7071 13.2929C21.5196 13.1054 21.2652 13 21 13ZM20 20H15V15H20V20ZM10 2H3C2.73478 2 2.48043 2.10536 2.29289 2.29289C2.10536 2.48043 2 2.73478 2 3V10C2 10.2652 2.10536 10.5196 2.29289 10.7071C2.48043 10.8946 2.73478 11 3 11H10C10.2652 11 10.5196 10.8946 10.7071 10.7071C10.8946 10.5196 11 10.2652 11 10V3C11 2.73478 10.8946 2.48043 10.7071 2.29289C10.5196 2.10536 10.2652 2 10 2ZM9 9H4V4H9V9Z" fill="#E52A49"/>
                </svg>  
                        <text>
                    محصولات
                        </text>
                </div>
                <div className={styles.cardsofpro}>
                <Productcard name={'۸۰کریستال گنشین'} price={'قیمت ۲۴۰۰۰ تومان'}/>
                <Productcard name={'۸۰کریستال گنشین'} price={'قیمت ۲۴۰۰۰ تومان'}/>
                <Productcard name={'۸۰کریستال گنشین'} price={'قیمت ۲۴۰۰۰ تومان'}/>
                <Productcard name={'۸۰کریستال گنشین'} price={'قیمت ۲۴۰۰۰ تومان'}/>
                <Productcard name={'۸۰کریستال گنشین'} price={'قیمت ۲۴۰۰۰ تومان'}/>
                <Productcard name={'۸۰کریستال گنشین'} price={'قیمت ۲۴۰۰۰ تومان'}/>
                <Productcard name={'۸۰کریستال گنشین'} price={'قیمت ۲۴۰۰۰ تومان'}/>
                <Productcard name={'۸۰کریستال گنشین'} price={'قیمت ۲۴۰۰۰ تومان'}/>
                </div>
                    
                </div>
        </div>
    )
}